Autodesk.Revit.DB.FilledRegionType.IsValidMasking(System.Boolean)
Check that in a family the FillRegionType is always masking.
isMasking:
The isMasking value to check.
Returns:
True if the IsMasking property can be set to the new value.
Since:
2024

Autodesk.Revit.DB.FilledRegionType.IsValidFillPatternId(Autodesk.Revit.DB.ElementId)
Check if the id is a FillPatternElement or an invalidElementId
patternId:
Element id of the FillPatternElement
Returns:
True if the id is InvalidElementId, or if the element is a FillPatternElement.
False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegionType.IsValidSolidFillPatternId(Autodesk.Revit.DB.ElementId)
Checks if the id is valid for a background pattern
patternId:
Element id of the FillPatternElement
Returns:
False if in a family and the id is a solid fill pattern and 'isMasking' is masking is false.
True otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegionType.IsValidBackgroundPatternId(Autodesk.Revit.DB.ElementId)
Check if the id is valid for a background pattern
Remarks:
The FillPatternElement must be a 'Drafting' pattern.
patternId:
Element id of the FillPatternElement
Returns:
False if the FillPatternElement is a model pattern.
True otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegionType.IsValidForegroundPatternId(Autodesk.Revit.DB.ElementId)
Check if the id is valid for a foreground pattern
Remarks:
In a family the FillPatternElement must be a 'Drafting' pattern.
patternId:
Element id of the FillPatternElement
Returns:
False if in a family, and the id is a FillPatternElement that targets 'Drafting'.
True otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegionType.BackgroundPatternColor
The background fill pattern color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FilledRegionType.ForegroundPatternColor
The foreground fill pattern color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FilledRegionType.IsMasking
If true then the FilledRegion will cover the lines and edges of objects behind it.
If false then lines and edges will remain visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: In a family a FilledRegionType with a solid fill pattern isMasking must always be true.
Since:
2019

Autodesk.Revit.DB.FilledRegionType.BackgroundPatternId
The background fill pattern Id.
Remarks:
The FillPattern used for a background pattern must have a 'Drafting' target.
This applies to both project and family elements.
In addition, when the FilledRegionAttributes element is in a family, the pattern
cannot be the solid fill pattern unless the 'IsMasking' property is set to true.
InvalidElementId is used when there is no background pattern
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The patternId must either be InvalidElementId or represent a valid FillPatternElement.
-or-
When setting this property: The patternId must be a 'Drafting' pattern.
-or-
When setting this property: In a family the patternId can not be a solid fill pattern if the 'IsMasking' property is false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FilledRegionType.ForegroundPatternId
The foreground fill pattern Id.
Remarks:
When the FilledRegionAttributes element is in a family then
the FillPattern used for a foreground pattern must have a 'Drafting' target.
In addition, when the FilledRegionAttributes element is in a family, the pattern
cannot be the solid fill pattern unless the 'IsMasking' property is set to true.
InvalidElementId is used when there is no foreground pattern
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The patternId must either be InvalidElementId or represent a valid FillPatternElement.
-or-
When setting this property: In a family the patternId must be a 'Drafting' pattern.
-or-
When setting this property: In a family the patternId can not be a solid fill pattern if the 'IsMasking' property is false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019